import {
  AboutList,
  AboutTitle,
  AboutText,
  AboutImage,
  AboutListItem,
  ItemWrappper,
} from './AboutUs.styled';
import bakery from '../../image/bakery.jpg';
import refreg from '../../image/refregerator.jpg';
import cokies from '../../image/cokies.jpg';

export default function AboutUs() {
  return (
    <>
      <AboutTitle>Наша місія</AboutTitle>
      <AboutList>
        <AboutListItem>
          <ItemWrappper>
            <AboutText>
              Шановні гості, ми вітаємо вас на сайті нашої
              кондитерської-пекарні! Наша команда вже протягом багатьох років
              працює для того, щоб надати вам найсмачніші і найякісніші десерти
              та хлібобулочні вироби. Ми поєднуємо унікальні рецепти зі свіжими
              інгредієнтами, щоб забезпечити вам тільки найкращі продукти. Наша
              команда зробить все можливе, щоб ваше перебування в нашій
              кондитерсько-пекарні було приємним та задовольним. На нашому сайті
              ви зможете ознайомитися з нашою історією, нашою філософією та
              останніми новинами нашої компанії. Ми запрошуємо вас дізнатися
              більше про нас та наші продукти. Дякуємо, що відвідали наш сайт і
              ми сподіваємося зустріти вас в нашій кондитерсько-пекарні
              незабаром.
            </AboutText>
          </ItemWrappper>
          <ItemWrappper>
            <AboutImage src={bakery} alt="" />
          </ItemWrappper>
        </AboutListItem>

        <AboutListItem>
          <ItemWrappper>
            <AboutText>
              Шановні гості, ми вітаємо вас на сайті нашої
              кондитерської-пекарні! Наша команда вже протягом багатьох років
              працює для того, щоб надати вам найсмачніші і найякісніші десерти
              та хлібобулочні вироби. Ми поєднуємо унікальні рецепти зі свіжими
              інгредієнтами, щоб забезпечити вам тільки найкращі продукти. Наша
              команда зробить все можливе, щоб ваше перебування в нашій
              кондитерсько-пекарні було приємним та задовольним. На нашому сайті
              ви зможете ознайомитися з нашою історією, нашою філософією та
              останніми новинами нашої компанії. Ми запрошуємо вас дізнатися
              більше про нас та наші продукти. Дякуємо, що відвідали наш сайт і
              ми сподіваємося зустріти вас в нашій кондитерсько-пекарні
              незабаром.
            </AboutText>
          </ItemWrappper>
          <ItemWrappper>
            <AboutImage src={refreg} alt="" />
          </ItemWrappper>
        </AboutListItem>

        <AboutListItem>
          <ItemWrappper>
            <AboutText>
              Шановні гості, ми вітаємо вас на сайті нашої
              кондитерської-пекарні! Наша команда вже протягом багатьох років
              працює для того, щоб надати вам найсмачніші і найякісніші десерти
              та хлібобулочні вироби. Ми поєднуємо унікальні рецепти зі свіжими
              інгредієнтами, щоб забезпечити вам тільки найкращі продукти. Наша
              команда зробить все можливе, щоб ваше перебування в нашій
              кондитерсько-пекарні було приємним та задовольним. На нашому сайті
              ви зможете ознайомитися з нашою історією, нашою філософією та
              останніми новинами нашої компанії. Ми запрошуємо вас дізнатися
              більше про нас та наші продукти. Дякуємо, що відвідали наш сайт і
              ми сподіваємося зустріти вас в нашій кондитерсько-пекарні
              незабаром.
            </AboutText>
          </ItemWrappper>
          <ItemWrappper>
            <AboutImage src={cokies} alt="" />
          </ItemWrappper>
        </AboutListItem>
      </AboutList>
    </>
  );
}
