import {
  Wrapper,
  AboutList,
  AboutTitle,
  AboutText,
  AboutImage,
  AboutListItem,
  ItemWrappper,
  AboutLink,
  TextWrapper,
} from './AboutUs.styled';
import bakery from '../../images/bakery.webp';
import refreg from '../../images/refregerator.webp';
import cokies from '../../images/cokies.webp';

export default function AboutUs() {
  return (
    <Wrapper>
      <AboutTitle>Наша місія</AboutTitle>
      <AboutList>
        <AboutListItem>
          <ItemWrappper>
            <TextWrapper>
              <AboutText>
                Кондитерська-пекарня «Франц Захер» була заснована влітку 2017
                року. Головна наша мета - це створення закладу, який
                виготовлятиме якісну продукцію, використовуючи виключно
                натуральні інгредієнти, сучасне обладнання та передові
                кондитерські технології в поєднанні з класичною рецептурою.
                Заклад зустрічає відвідувачів неперевершеною атмосферою Відня
                XIX століття, втіленою в дизайні в австрійсько-баварському
                стилі.
              </AboutText>
              <AboutText>
                Ми назвали свою пекарню на честь відомого австрійського кулінара
                та кондитера Франца Захера, винахідника однойменного торта
                «Захер». Цей знаменитий шоколадний торт вважається візитівкою
                віденських ресторанів та кав'ярень і водночас кулінарним
                шедевром й одним із найпопулярніших десертів у світі.
              </AboutText>
              <AboutText>
                Наші кондитери ні в чому не поступаються своїм віденським
                колегам і готують свої торти та інші смаколики з величезною
                любов'ю, вкладаючи в них душу та всю свою майстерність,
                створюючи неперевершені кулінарні шедеври на будь-який смак та
                вподобання.
              </AboutText>
            </TextWrapper>
          </ItemWrappper>
          <ItemWrappper>
            <AboutImage src={bakery} alt="Interior" />
          </ItemWrappper>
        </AboutListItem>
        <AboutListItem>
          <ItemWrappper>
            <TextWrapper>
              <AboutText>
                Кожен відвідувач зможе насолодитися неперевершеною атмосферою
                закладу за філіжанкою ароматного еспресо, класичного капучино
                або ж чашечкою міцного англійського чорного чаю з смачнющими
                тортиками, тістечками чи штруделями, відчуваючи себе мешканцем
                однієї з найкрасивіших столиць Європи минулих століть.
              </AboutText>
              <AboutText>
                Любите теплі, душевні розмови з друзями або з нетерпінням
                очікуєте романтичну зустріч з коханою людиною? Чи можливо вас на
                вулиці зненацька застала дощем непередбачувана львівська погода?
                Тоді завітайте до нас на філіжанку кави та дегустацію
                зігріваючих наливок/лікерів/коньяку/бренді під акомпонемент
                шматочка "Захеру" чи "Київського" - і чудовий настрій ми Вам
                гарантуємо!
              </AboutText>
            </TextWrapper>
          </ItemWrappper>
          <ItemWrappper>
            <AboutImage src={refreg} alt="Products" />
          </ItemWrappper>
        </AboutListItem>
        <AboutListItem>
          <ItemWrappper>
            <TextWrapper>
              <AboutText>
                Наша пекарня неодмінно вразить вас величезним асортиментом
                власної продукції: сирні, шоколадні і фруктові торти,
                різноманітні штруделі, десерти, печиво та тістечка, широкий
                вибір хлібобулочних виробів, виготовлених виключно з натуральних
                складників - органічного цільнозернового пшеничного борошна,
                висівок, насіння, горіхів та інших додатків.
              </AboutText>
              <AboutText>
                Детальніше ознайомитись з переліком пропонованої продукції ви
                можете в відповідному розділі нашого сайту
                <AboutLink to="/Products"> "Наша продукція"</AboutLink>.
              </AboutText>
            </TextWrapper>
          </ItemWrappper>
          <ItemWrappper>
            <AboutImage src={cokies} alt="Products" />
          </ItemWrappper>
        </AboutListItem>
      </AboutList>
    </Wrapper>
  );
}
